## Introduction to Pandas: Series and Dataframes

Series: like one dimensional array, not restricted to just numeric types, optimised for iterating through values. Built on top of numpy.

Dataframe : like Two dimensional array with row indices and column names. Can contain Mixed type attributes.

Series:

In [89]:
# Create a Series : using pd.Series(numpy_array)
import pandas as pd 
import numpy as np

m = pd.Series([1,2,3,4,5])

# print m
m

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [90]:
# Accessing elements of a series : like a 1d list 
# to print single index
m[1]

2

In [91]:
# to print set of indices(rows) : print all rows from index 1
m[1:]

1    2
2    3
3    4
4    5
dtype: int64

In [92]:
# we can print random indexed rows 
# NOTE: m[1,3] will not work to print indices 1 and 3, We need pass in a list like [1,3] in original []
m[[1,3]]

1    2
3    4
dtype: int64

In [93]:
#To contrast with numpy array and pandas series, we have an apply() that applies a function to each element of it. and this is supported only for pandas series.
np.arange(10).apply(lambda x:x+1)

AttributeError: 'numpy.ndarray' object has no attribute 'apply'

In [ ]:
pd.Series([1,2,3,4]).apply(lambda x:x+1)

Dataframes: Real world data is mentioned i this format. Every row is an object and every column is an attribute.

In [ ]:
Creating Dataframes : many Ways
1) from Dictionary
2) from csv file
3) from json file
4) from text file

In [ ]:
# 1) from Dictionary:
df = pd.DataFrame({'Name':['Santoshkumar vagga', 'Suraj Chauhan', 'Satish Biradar', 'Uday Poddar'],
                    'Age':[25,26,24,27],
                    'Education':['M.Sc','M.D', 'B.E', 'M.E']})
df

In [ ]:
# 2) from csv: NOTE: Save as CSV(Comma delimited)
df = pd.read_csv("sample_book.csv")
df

Reading and Summarising Dataframes

In [ ]:
# Print top 5 rows
df.head()

In [ ]:
# print last 5 rows
df.tail()

In [ ]:
# to know datatypes of each column
df.info()

In [ ]:
# to know total rows and columns
df.shape

In [ ]:
# to get numerical statistics of each column like mean, min, max(only for numeric type columns)
df.describe()

In [ ]:
# get all column names of dataframe
df.columns

In [ ]:
# get each row as numpy array
df.values

Set custom index column: using set_index()

In [ ]:
df = pd.read_csv("sample_book.csv")
df.set_index('Team', inplace=True)
df

Sorting Dataframes:

1) Sorting Index:

In [ ]:
# 1) Sort Index: using sort_index() 
df = pd.read_csv("sample_book.csv")
df.set_index('Team', inplace=True)
df.sort_index(ascending=True, inplace = True)
df

2) Sorting Values: We can also sort by any custom column(s)

In [ ]:
# using sort_values(axis=0, ascending = Truem inplace=True)
# Note: if axis =1, it considers coulumn wise. if axis = 0, then it considers row wise.

In [ ]:
df.sort_values('Squad_team', ascending=False, inplace=True)
df

In [ ]:
# We can also perform sorting using >1 columns: It will sort using second column , then for the result it applies sorting based on first column given. (REVERSE order)
df.sort_values(by=['Total_Seasons', 'Squad_team'], ascending=True, inplace=True)
df

Indexing and Selecting data:

1) Selecting rows from a dataframe
2) Selecting columns from a dataframe
3) Selecting columns from a dataframe

In [ ]:
# 1) Selecting rows:
df[2:6]

In [ ]:
# Selecting alternate rows (from 3rd row to till last but in alternate fashion)
df[3::2]

In [ ]:
# 2) Selecting Columns: Each Column is a pandas series. 2 ways: a) using [] 2) using .NOTE: We can extract both as Series and Dataframe
# a) using [] : as Series.
df['Captain']

In [ ]:
type(df['Captain'])

In [ ]:
# b) using . : as Series
df.Captain

In [ ]:
type(df.Captain)

In [ ]:
# as Dataframe : Just embed in []
df[["Captain"]]

In [ ]:
type(df[["Captain"]])

In [ ]:
# Selecting multiple columns : returns always a Dataframe
# NOTE: dont specify Index in list, since it appears by default for every row
df[['Captain', 'Total_Seasons']]

In [ ]:
type(df[['Captain', 'Total_Seasons']])

In [ ]:
# Unlike Series(1D array), We cannot access a Dataframe by Just One parameter like Dataframe[2].

In [34]:
df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [33]:
# To print only even number rows in Dataframe
df[2::2]

       Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
RR     S Smith     A Rahane        1.0              8          39
KXP   KL Rahul    M Agarwal        NaN             11          42
DC      S Iyer       R Pant        2.0             12          40

## Pandas recommneds to use below 2 approcahes for indexing, subsetting. Since they are more explicit.
#1) Position based Indexing: using df.iloc
#2) Label based indexing: using df.loc

In [45]:
# 1) Position based Indexing: # Use help(pd.DataFrame.iloc) for detailed info
# df.iloc[  a , b ] 
# a = row info, can be single digit or a list. 
# b = column info, can be single digit or a list

# Possible Combinations for a or b:
# m:n
# here, m is starting index and n-1 is ending Index

In [51]:
df.iloc[2] # series output, print third row, all columns

Captain           S Smith
Vice_Captain     A Rahane
Won_times               1
Total_Seasons           8
Squad_team             39
Name: RR, dtype: object

In [50]:
df.iloc[[2]] # Dataframe output, print tird row, all columns

      Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
RR    S Smith     A Rahane        1.0              8          39

In [57]:
df.iloc[[2,3,4],[1,2,3]] # 3,4,5th rows and 2,3,4th columns

     Vice_Captain  Won_times  Total_Seasons
Team
RR       A Rahane        1.0              8
CSK      A Jadeja        3.0             10
KXP     M Agarwal        NaN             11

In [58]:
df.iloc[2:6,3:5] # 3,4,5,6th row and 4, 5th column

      Total_Seasons  Squad_team
Team
RR                8          39
CSK              10          41
KXP              11          42
MI               12          38

In [60]:
df.iloc[[2:4]]

SyntaxError: invalid syntax (<ipython-input-60-d9dc4857998e>, line 1)

In [96]:
# Using boolena array: selects only rows corresponding to true.
df.iloc[[True, True,False, True, False, True, False,True]]

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
CSK       MS Dhoni       A Jadeja        3.0             10          41
MI    Rohit Sharma      K Pollard        5.0             12          38
RCB    Virat Kohli  AB de villers        NaN             12          40

In [97]:
# 1) Selecting based on Labels: using df.loc
# WKT it is possible to have our own custom index.

df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [103]:
df.loc[['SRH', 'KXP', 'MI'], :]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner     M Pandey        1.0              7          39
KXP       KL Rahul    M Agarwal        NaN             11          42
MI    Rohit Sharma    K Pollard        5.0             12          38

In [106]:
df.loc[['SRH', 'KXP', 'MI'], 'Vice_Captain':'Squad_team']

     Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH      M Pandey        1.0              7          39
KXP     M Agarwal        NaN             11          42
MI      K Pollard        5.0             12          38

In [ ]:
Subsetting Dataframes based on Conditions:

In [107]:
df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [112]:
# using a boolean array: df['Won_times']>2.0
df.loc[df['Won_times']>2.0]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni     A Jadeja        3.0             10          41
MI    Rohit Sharma    K Pollard        5.0             12          38

In [113]:
# Equivalent to above one
df.loc[df['Won_times']>2.0, ]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni     A Jadeja        3.0             10          41
MI    Rohit Sharma    K Pollard        5.0             12          38

In [114]:
df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [116]:
df.loc[(df.Total_Seasons>8) & (df.Squad_team>40)]

       Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK   MS Dhoni     A Jadeja        3.0             10          41
KXP   KL Rahul    M Agarwal        NaN             11          42

In [118]:
df.loc[(df.Total_Seasons>8) | (df.Squad_team>40)]

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [125]:
# We can filter column to have selected rows. NOTE: Items in List should be part of Column under filter.
valid_rows = ['A Jadeja', 'R Pant']
df.loc[df.Vice_Captain.isin(valid_rows)]

       Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK   MS Dhoni     A Jadeja        3.0             10          41
DC      S Iyer       R Pant        2.0             12          40

## Merge and Append(Concat):

##1) Merging two or more dataframes using pd.merge()

In [129]:
df_1 = df
df_2 = pd.read_csv("sample_workbook_2.csv")
df_2

        Captain  ODI_RUNS  Catches
0   Virat Kohli     25000      840
1  Rohit Sharma     13000      490
2      MS Dhoni     12000     1280
3      KL Rahul      3000      390
4      D Kartik      3500      320
5       Dwarner      8000      790
6        S Iyer      1000      321
7       S Smith      8000      800

In [131]:
# how = "inner" makes merge using same column in both dataframes so we will have all columns in both dataframes but only one common column
pd.merge(df_1, df_2, how="inner", on="Captain")

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,ODI_RUNS,Catches
0,Dwarner,M Pandey,1.0,7,39,8000,790
1,D Kartik,A Russel,2.0,8,38,3500,320
2,S Smith,A Rahane,1.0,8,39,8000,800
3,MS Dhoni,A Jadeja,3.0,10,41,12000,1280
4,KL Rahul,M Agarwal,NaN,11,42,3000,390
5,Rohit Sharma,K Pollard,5.0,12,38,13000,490
6,S Iyer,R Pant,2.0,12,40,1000,321
7,Virat Kohli,AB de villers,NaN,12,40,25000,840